app/controllers/mess_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    begin
      @twitter = @wrapper.get_twitter
      @account = @twitter.user_timeline.first.user.screen_name