app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "created_at", "access_secret", "updated_at", "admin", "password_hash", "email", "access_token") VALUES('449be9bc37424ede4693d2b61a9e3e95f091baa3', '2010-07-01 20:14:27', NULL, '2010-07-01 20:14:27', 'f', '511a3127a2edcace17fa106e006181a0e89be912', 'adityadixit06@gmail.com', NULL)
---
  def create
    @user = User.new params[:user]
    if @user.save